gneidermeier/stm8_mcp/src/driver.c
/*
 * decrement set and return present motor speed value
 */
uint16_t BLDC_PWMDC_Minus()
{
    if (BLDC_OFF == BLDC_State)
    {
        uart_print( "OFF->RAMP-\r\n");
        BLDC_State = BLDC_RAMPUP;
        return 0;
    }
    else if (BLDC_ON == BLDC_State)
    {
// if (DC > PWM_20PCNT)
        dec_dutycycle();
    }
    return global_uDC;
}

/*
 * sets motor speed from commanded throttle/UI setting  (experimental)
 */
void BLDC_PWMDC_Set(uint16_t dc)
{
        if (dc < 0x10)
        {
            BLDC_Stop();
        }

// if presently OFF, then capture the commanded throttle value
    if (BLDC_OFF == BLDC_State)
    {
        // todo: must be off for X to (re)enable startup.

        if ( dc > 10 )
        {
            BLDC_State = BLDC_RAMPUP;
            uart_print( "THR ... OFF->RAMP-\r\n");
        }
    }

    if (BLDC_ON == BLDC_State )
    {
        if (dc > 0x1d)
        {
            if ( global_uDC < dc )
            {
                // TODO:  rate-limit on this ...
                inc_dutycycle();
            }
            else if ( global_uDC > dc )
            {
                dec_dutycycle();
            }
        }
    }
}

/*
 * TEST DEV ONLY: manual adjustment of commutation cycle time)
 */
void BLDC_Spd_dec()
{
    if (BLDC_OFF == BLDC_State)
    {
        BLDC_State = BLDC_RAMPUP;
        uart_print( "OFF->RAMP-\r\n");
    }

    if (BLDC_ON == BLDC_State  && BLDC_OL_comm_tm < 0xFFFF)
    {
        Manual_Mode = 1;
        BLDC_OL_comm_tm += 1; // slower
    }

    Log_Level = 255;// enable continous/verbous log
}

/*
 * TEST DEV ONLY: manual adjustment of commutation cycle time)
 */
void BLDC_Spd_inc()
{
    Log_Level = 1; // default on INC button is just print one line

    if (BLDC_OFF == BLDC_State)
    {
        BLDC_State = BLDC_RAMPUP;
        // BLDC_OL_comm_tm ... init in OFF state to _OL_TM_LO_SPD, don't touch!

        uart_print( "OFF->RAMP+\r\n");
        Log_Level = 0xFF; // log enuff output to span the startup (logger is slow, doesn't take that many)
    }

    if (BLDC_ON == BLDC_State  && BLDC_OL_comm_tm > BLDC_OL_TM_MANUAL_HI_LIM )
    {
        Manual_Mode = 1;
        BLDC_OL_comm_tm -= 1; // faster
    }
}


/*
 * BLDC Update: 
 *  Called from ISR
 *  Handle the BLDC state: 
 *      Off: nothing
 *      Rampup: get BLDC up to sync speed to est. comm. sync.
 *              Once the HI OL speed (frequency) is reached, then the idle speed
 *              must be established, i.e. controlling PWM DC to ? to achieve 2500RPM
 *              To do this closed loop, will need to internally time between the
 *              A/D or comparator input interrupts and adjust DC using e.g. Proportional
 *              control. When idle speed is reached, can transition to user control i.e. ON State
 *      On:  definition of ON state - user control (button inputs) has been enabled
 *              1) ideally, does nothing - BLDC_Step triggered by A/D comparator event
 *              2) less ideal, has to check A/D or comp. result and do the comm.
 *                 step ... but the resolution will be these discrete steps
 *                 (of TIM1 reference)
 */
static uint16_t   Table_value; //whats up w/ stupid compiler optimizing
static int vsys_fault_bucket;

void BLDC_Update(void)
{
    const int FAULT_BUCKET_INI = 128;

// if the voltage threshold is high enuff, the ramp delay time thingy not needed
    const int RAMP_TIME = 1;   // fault arming delay time
    static uint16_t fault_arming_time; // fault_arming_time  

    switch (BLDC_State)
    {
    default:
    case BLDC_OFF:
        // reset commutation timer and ramp-up counters ready for ramp-up
        BLDC_OL_comm_tm = BLDC_OL_TM_LO_SPD;

        vsys_fault_bucket = FAULT_BUCKET_INI;

        // delay to wait to stabillize at first DC setpoint post-ramp
        fault_arming_time = RAMP_TIME;    /////// // reset the static ramp timer

        set_dutycycle( PWM_0PCNT );
        break;

    case BLDC_ON:
        // do ON stuff
        Vsystem = Vbatt / 2 + Vsystem / 2; // sma
#if 0  // .. Todo: needs to adjust threshold for in-ramp
        if ( fault_arming_time  > 0 )
        {
            fault_arming_time   -= 1;
        }
        else    // assert (Vbatt > VVV )
#endif
        {
            // check system voltage ... is motor stalled?
            if (Vsystem < V_SHUTDOWN_THR)
            {
                // voltage has sagged ... likely motor stall!
                if ( vsys_fault_bucket  > 0)
                {
                    vsys_fault_bucket -= 1; //
                }
            }
            else
            {
                if ( vsys_fault_bucket  < FAULT_BUCKET_INI )
                {
                    vsys_fault_bucket += 1; // refillin leaky bucket
                }
            }
// finally, check if fault is set
            if (0 == vsys_fault_bucket)
            {
                // 0 DC safely stops the motor, user must still press STOP to cycle the program.
                set_dutycycle( PWM_0PCNT );
            }
        }

// grab the "speed" number from the table, determine (sign of) error and incr. +/- 1
/*
basically theres a possiblity that at a high enough speed it could instead take
the error of the +/- back-EMF sensed ZC   and use e * Kp to determine the step 
*/
        if ( 0 == Manual_Mode && global_uDC < OL_TIMING_TBL_SIZE )
        {
            int error, step = 0;
            Table_value =  OL_Timing[ global_uDC ];

            error =  Table_value  - BLDC_OL_comm_tm;
            /*
             * the C-T increments between PWM steps are rather large as speeding up 
             * so it may be possible to comp. by reducing rate of this loop by /2
             */
            if (error > 0)
            {
                step = 1;
            }
            else if (error < 0)
            {
                step = -1;
            }

            if (Table_value != 0) // assert
            {
                BLDC_OL_comm_tm += step; // incrementally adjust until error reduces to 0.
            }
        }

        break;

