gneidermeier/stm8_mcp/src/driver.c
    case BLDC_RAMPUP:

        set_dutycycle( PWM_DC_RAMPUP ); // shouldn't need to keep setting the ramp DC every iteration .. do it once at -transition into ramp state

        if (BLDC_OL_comm_tm > BLDC_OL_TM_HI_SPD) // state-transition trigger?
        {
            BLDC_OL_comm_tm -= BLDC_ONE_RAMP_UNIT;
        }
        else
        {
            BLDC_State = BLDC_ON;

            Vsystem = Vbatt; // "pre-load" the avergae to avoid kicking out at end of ramp1

            Manual_Mode = 0;
            set_dutycycle( PWM_DC_IDLE );

//            Log_Level = 16; // tmp debug
        }
        break;
    }

//  update the timer for the OL commutation switch time
    TIM3_setup(BLDC_OL_comm_tm);
}

/*
 * called from ISR
 *
// establish error-signal ...
// measures at 4 15-degree intervals - [1] and [2] are the valid ones to "integrate"
// Note at this low idle/open-loop speed there are only about 4 PWM @ 8k during
// a 60-degree sector.
// Pulses close to start/end of the secctor are problematic anyway as the ADC 
// ISR ends up getting blocked by the TIM3 ISR ... the BLDC_Step() takes about
// to 40us on case 3!
 */
void BLDC_Step(void)
{
    const uint8_t N_CSTEPS = 6;

    static uint8_t bldc_step_modul; // internal counter for sub-dividing the TIM3 period

    static COMMUTATION_SECTOR_t comm_step = 0;


    if (BLDC_OFF != BLDC_State )
    {
        // grab the state of previous sector (before advancing the 6-step sequence)
        BLDC_PWM_STATE_t  prev_A = Commutation_Steps[ comm_step ].phA;

        int index = bldc_step_modul % TIM3_RATE_MODULUS;

// Note if wanting all 3 phases would need to coordinate here to set the
// correct ADC channel to sample.

        switch(index)
        {
        case 0:
            Back_EMF_15304560[0] = GET_BACK_EMF_ADC( );
            break;
        case 1:
            Back_EMF_15304560[1] = GET_BACK_EMF_ADC( );
            break;
        case 2:
            Back_EMF_15304560[2] = GET_BACK_EMF_ADC( );
            break;
        case 3:
            Back_EMF_15304560[3] = GET_BACK_EMF_ADC( );

            if ( DC_OUTP_FLOAT_R == prev_A )
            {
            }
            else  if (DC_OUTP_FLOAT_F == prev_A )
            {
// if phase-A previous sector was floating-falling transition, then the measurements are qualified by copying from the temp array 
                memcpy( Back_EMF_Falling_4, Back_EMF_15304560, sizeof(Back_EMF_Falling_4) );
/*
                Back_EMF_Falling_4[0] = Back_EMF_15304560[0]; // unused
                Back_EMF_Falling_4[1] = Back_EMF_15304560[1]; // pre-ZCP
                Back_EMF_Falling_4[2] = Back_EMF_15304560[2]; // post-ZCP
                Back_EMF_Falling_4[3] = Back_EMF_15304560[3]; // unused
*/
// sum the pre-ZCP and post-ZCP measurements
                Back_EMF_Falling_Int_PhX = 
                       Back_EMF_Falling_4[1] + Back_EMF_Falling_4[2];
            }
            else  if (DC_OUTP_HI == prev_A)
            {
                // if phase was driven pwm, then use the measurement as vbat
                Vbatt = GET_ADC();
            }

            comm_switch( comm_step );

            comm_step = (comm_step + 1) % N_CSTEPS;

            break;
        }

        bldc_step_modul += 1; // can allow rollover as modulus is power of 2
    }
    else
    {
        // motor drive output is not active
        GPIOC->ODR &=  ~(1<<5); //  /SD A
        GPIOC->ODR &=  ~(1<<7); //  /SD B
        GPIOG->ODR &=  ~(1<<1); //  /SD C

        TIM1_CtrlPWMOutputs(DISABLE);
    }
}
